In [5]:
import pandas as pd

In [6]:
#Ans1:
df=pd.Series([4,8,15,16,23,42])

In [7]:
df

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [8]:
#Ans2:
a=[1,2,3,4,5,6,7,8,9,10]
po=pd.Series(a)

In [9]:
po

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [23]:
#Ans:3
Data={'Name':['Alice','Bob','Claire'],'Age':['25','30','27'],'Gender':['Female','Male','Female']}

s=pd.DataFrame(Data)

In [24]:
s

     Name Age  Gender
0   Alice  25  Female
1     Bob  30    Male
2  Claire  27  Female

In [25]:
#Ans4:Series can only contain single list with index, whereas dataframe can be made of more than one series

In [28]:
#Ans5:some common functions is dtypes,type,head,tail,loc,iloc
#Example:df.dtypes=='object'

In [29]:
#Ans6:Series,Datframe,Panel is mutable

In [31]:
#Ans7:

Data={'Name':['Alice','Bob','Claire'],'Age':['25','30','27'],'Gender':['Female','Male','Female']}

In [32]:
p=pd.DataFrame(Data)

In [33]:
p

     Name Age  Gender
0   Alice  25  Female
1     Bob  30    Male
2  Claire  27  Female